# Install command-line tools using Homebrew

# Set up taps first
tap 'homebrew/bundle'
tap 'homebrew/boneyard'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'homebrew/python'
tap 'homebrew/science'
tap 'homebrew/services'
tap 'homebrew/versions'
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'beeftornado/rmtree'
tap 'buo/cask-upgrade'

# Install Homebrew packages
brew 'autoconf'
brew 'automake'
brew 'bash'
brew 'binutils'
brew 'cmake'
brew 'coreutils'
brew 'cscope'
brew 'ctags'
brew 'diffutils'
brew 'doxygen'
brew 'ed'
brew 'file-formula'
brew 'findutils'
brew 'gawk'
brew 'gcc', args: ['without-multilib'] #disable multilib for OpenMP support
brew 'gcc@4.9'
brew 'gdb'
brew 'ghostscript'
brew 'git'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'gnupg2'
brew 'gnutls'
brew 'gpatch'
brew 'gpg'
brew 'graphviz', args: ['with-librsvg', 'with-x11']
brew 'grep'
brew 'gzip'
brew 'htop'
brew 'hub'
brew 'imagemagick', args: ['with-librsvg', 'with-x11']
brew 'less'
brew 'make'
brew 'mercurial'
brew 'moreutils'
brew 'mpich', args: ['cc=gcc-6', 'build-from-source']
brew 'nmap'
brew 'node'
brew 'perl'
brew 'python'
brew 'python3'
brew 'pyqt5', args: ['with-python']
brew 'reattach-to-user-namespace'
brew 'ruby'
brew 'rsync'
brew 'svn'
brew 'swig'
brew 'the_silver_searcher'
brew 'tmux'
brew 'tree'
brew 'vim', args: ['with-override-system-vi', 'with-lua', 'with-luajit', 'with-tcl', 'with-client-server']
brew 'unrar'
brew 'unzip'
brew 'watch'
brew 'wdiff', args: ['with-gettext']
brew 'wget', args: ['enable-iri']
brew 'zmq'
brew 'zsh'
brew 'zsh-completions'

# Install GUI apps
cask 'alfred'
cask 'gitify'
cask 'cuda'
cask 'disk-inventory-x'
cask 'dropbox'
cask 'evernote'
cask 'flux'
cask 'go2shell'
cask 'google-chrome'
cask 'google-drive'
cask 'ichm'
cask 'iterm2'
cask 'java'
cask 'jdownloader'
cask 'keepassx'
cask 'logitech-myharmony'
cask 'macdown'
cask 'mactex'
cask 'mendeley-desktop'
cask 'mp4tools'
cask 'music-manager'
cask 'paraview'
cask 'papers'
cask 'skype'
cask 'slack'
cask 'sourcetree'
cask 'spectacle'
cask 'spotify'
cask 'steam'
cask 'synergy'
cask 'teamviewer'
cask 'texpad'
cask 'virtualbox'
cask 'visit'
cask 'vlc'
