# Install command-line tools using Homebrew

# Set up taps first
tap 'beeftornado/rmtree'
tap 'brewsci/bio'
tap 'buo/cask-upgrade'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/services'

# Install Homebrew packages
brew 'automake'
brew 'bash'
brew 'bfg'
brew 'binutils'
brew 'brew-cask-completion'
brew 'cmake'
brew 'coreutils'
brew 'cppcheck'
brew 'cscope'
brew 'ctags'
brew 'diffutils'
brew 'doxygen'
brew 'ed'
brew 'file-formula'
brew 'findutils'
brew 'gawk'
brew 'gcc'
brew 'gdb'
brew 'ghostscript'
brew 'git'
brew 'git-lfs'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'gpatch'
brew 'grep'
brew 'grip'
brew 'gzip'
brew 'htop'
brew 'hub'
brew 'jq'
brew 'less'
brew 'make'
brew 'moreutils'
brew 'mpich'
brew 'multimarkdown'
brew 'neofetch'
brew 'nextflow'
brew 'nmap'
brew 'python3'
brew 'r'
brew 'rbenv-bundler'
brew 'rbenv-gemset'
brew 'rsync'
brew 'the_silver_searcher'
brew 'thefuck'
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'watch'
brew 'wdiff'
brew 'wget'
brew 'zmq'
brew 'zsh'
brew 'zsh-completions'

# Install GUI apps
cask 'alfred'
cask 'appcleaner'
cask 'bartender'
cask 'bettertouchtool'
cask 'box-drive'
cask 'cheatsheet'
cask 'daisydisk'
cask 'dash'
cask 'dashlane'
cask 'docker'
cask 'dropbox'
cask 'dropzone'
cask 'evernote'
cask 'fantastical'
cask 'flux'
cask 'focus'
cask 'gitify'
cask 'gitkraken'
cask 'go2shell'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'hazel'
cask 'ichm'
cask 'iterm2'
cask 'java'
cask 'keepingyouawake'
cask 'keka'
cask 'little-snitch'
cask 'macdown'
cask 'mactex'
cask 'malwarebytes'
cask 'micro-snitch'
cask 'onedrive'
cask 'paintbrush'
cask 'pdf-expert'
cask 'popclip'
cask 'skype'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'steam'
cask 'synergy'
cask 'texstudio'
cask 'textmate'
cask 'timing'
cask 'transmission'
cask 'typinator'
cask 'virtualbox'
cask 'vlc'
cask 'vyprvpn'
cask 'xquartz'
cask 'zoomus'
