# Install command-line tools using Homebrew

# Set up taps first

tap 'aws/tap'
tap 'fabianishere/personal'
tap 'hashicorp/tap'
tap 'homebrew/bundle'
tap 'jakehilborn/jakehilborn'

# Install Homebrew packages
brew 'adns'
brew 'automake'
brew 'aws-cdk'
brew 'aws-nuke'
brew 'awscli'
brew 'bfg'
brew 'binutils'
brew 'bpytop'
brew 'brew-cask-completion'
brew 'cmake'
brew 'coreutils'
brew 'cppcheck'
brew 'cscope'
brew 'dash'
brew 'diffutils'
brew 'docbook-xsl'
brew 'dos2unix'
brew 'doxygen'
brew 'e2fsprogs'
brew 'ed'
brew 'exiftool'
brew 'expect'
brew 'file-formula'
brew 'findutils'
brew 'fontforge'
brew 'fpp'
brew 'fzy'
brew 'gawk'
brew 'gcc'
brew 'gdb'
brew 'git'
brew 'git-lfs'
brew 'git-secrets'
brew 'gnu-getopt'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'gnupg'
brew 'go'
brew 'gobject-introspection'
brew 'gpatch'
brew 'grep'
brew 'grip'
brew 'gzip'
brew 'hashicorp/tap/packer'
brew 'hashicorp/tap/terraform'
brew 'htop'
brew 'hub'
brew 'hugo'
brew 'ical-buddy'
brew 'jakehilborn/jakehilborn/displayplacer'
brew 'jansson'
brew 'jq'
brew 'kubernetes-cli'
brew 'less'
#brew 'little-snitch'
brew 'llvm@17'
brew 'make'
brew 'meson'
brew 'moreutils'
brew 'multimarkdown'
brew 'neofetch'
brew 'nghttp2'
brew 'nmap'
brew 'pam-reattach'
brew 'r'
brew 'rbenv-bundler'
brew 'rbenv-gemset'
brew 'reattach-to-user-namespace'
brew 'rsync'
brew 'rtmpdump'
brew 'rust'
brew 'shellcheck'
brew 'stress-ng'
brew 'telnet'
brew 'the_silver_searcher'
brew 'thefuck'
# brew 'timing'
brew 'tmux-mem-cpu-load'
brew 'tmux-xpanes'
brew 'tree'
brew 'unzip'
brew 'urlview'
brew 'vim'
brew 'virtualenvwrapper'
brew 'wakeonlan'
brew 'watch'
brew 'wdiff'
brew 'wget'
brew 'zmq'
brew 'zsh'
brew 'zsh-completions'

# Cask applications
cask 'alfred'
cask 'avidemux'
cask 'bartender'
cask 'bettertouchtool'
cask 'daisydisk'
cask 'drawio'
cask 'dropbox'
cask 'finch'
cask 'flux'
cask 'focus'
cask 'fontforge'
cask 'git-credential-manager'
cask 'gitify'
cask 'gitkraken'
cask 'go2shell'
cask 'hazel'
cask 'iterm2'
cask 'keepingyouawake'
cask 'keka'
cask 'macdown'
cask 'mactex'
cask 'microsoft-remote-desktop'
cask 'microsoft-teams'
cask 'miniconda'
cask 'openvpn-connect'
cask 'paintbrush'
cask 'pdf-expert'
cask 'popclip'
cask 'private-internet-access'
cask 'rectangle'
cask 'session-manager-plugin'
cask 'slack'
cask 'spotify'
cask 'steam'
cask 'switchresx'
cask 'texifier'
cask 'texstudio'
cask 'textmate'
cask 'timemachineeditor'
cask 'typinator'
cask 'unclutter'
cask 'vagrant'
cask 'visual-studio-code'
cask 'vitalsource-bookshelf'
cask 'vlc'
cask 'webex-meetings'
cask 'xmind'
cask 'zoom'
